Revit 2024 API
Application.ProgressChanged Event
 Subscribe to the ProgressChanged event to be notified when an operation in Revit has progress bar data available.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public event EventHandler<ProgressChangedEventArgs> ProgressChanged
Visual Basic
Public Event ProgressChanged As EventHandler(Of ProgressChangedEventArgs)
Visual C++
public:
 event EventHandler<ProgressChangedEventArgs^>^ ProgressChanged {
	void add (EventHandler<ProgressChangedEventArgs^>^ value);
	void remove (EventHandler<ProgressChangedEventArgs^>^ value);
}
Remarks
 Handlers of this event may use the Cancel() method to cancel the operation tracked by the progress bar. Users may not change the document in the handler for this event. Exception ModificationForbiddenException will be thrown if any document-modifying method is called during this event's handler.
See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace